FreeCAD/CfdOF/data/defaults/0/alphat
%{%(solver/solverName%)
%:hisa
%{%(physics/Turbulence%)
%:RANS
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

%{%(boundaries%)
%{%(boundaries/%(0%)/BoundaryType%)
%:wall
%{%(boundaries/%(0%)/BoundarySubtype%)
%:fixed translating partialSlip
    %(0%)
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
%:slip
%[0/_boundary_zeroGradient%]
%:rough
    %(0%)
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
%}
%:constraint
%[0/_boundary_constraint%]
%:default
%[0/_boundary_calculated%]
%}

%}
%{defaultFaces
%[0/_boundary_zeroGradient%]
%}

}

// ************************************************************************* //
%}
%}