FreeCAD/CfdOF/data/defaults/system/fvSolution
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

%{%(solver/solverName%)
%:hisa
pseudoTime
{
    pseudoTol          1e-6 (1e-6 1e-6 1e-6) 1e-6;
    pseudoCoNum        0.1;
    pseudoCoNumMax     25.0;

    pseudoCoNumMaxIncreaseFactor  1.5;
    pseudoCoNumMin                0.1;

    localTimestepping             true;
    localTimesteppingBounding     true;
    localTimesteppingLowerBound   0.85;

    // Last line of defense, in case of very poor grid
    rhoMin              0.01;  // TODO: Generalise
}

flowSolver
{
    solver             GMRES;
    GMRES
    {
        inviscidJacobian  LaxFriedrich;
        viscousJacobian   laplacian;
        preconditioner    LUSGS;

        maxIter           20;
        nKrylov           8;
        solverTolRel      1e-1 (1e-1 1e-1 1e-1) 1e-1;
    }
}

%:default
%{%(physics/Time%)
%:Steady
SIMPLE
{
    // Non-orthogonal correctors for robustness on tet meshes. Porous baffles require a
    // higher number of corrections.
    nNonOrthogonalCorrectors 5;

    consistent no;  // Setting this impairs stability of porous baffles
    residualControl
    {
        p %(solver/convergenceCriteria%);
        U %(solver/convergenceCriteria%);
        "(k|epsilon|omega|f|v2|nuTilda)" %(solver/convergenceCriteria%);
    }
    pRefValue   0;
    pRefCell    0;
}

%:Transient
PIMPLE
{
%{%(solver/solverName%)
%:interFoam multiphaseInterFoam
    nOuterCorrectors 3;
    nNonOrthogonalCorrectors 2;
    nCorrectors         2;
%:default
    nOuterCorrectors 10;
    nNonOrthogonalCorrectors 2;
    nCorrectors         2;
    outerCorrectorResidualControl
    {
        U
        {
            tolerance   %(solver/convergenceCriteria%);
            relTol      0;
        }
        p
        {
            tolerance   %(solver/convergenceCriteria%);
            relTol      0;
        }
    }
%}
    pRefValue   0;
    pRefCell    0;
}

%}
%}
potentialFlow
{
    nNonOrthogonalCorrectors 8;

    PhiRefValue 0;
    PhiRefCell 0;
}

solvers
{
%{%(solvers/solverName%)
%:hisa
%:default
    "(p|p_rgh|pcorr)"
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    "(pFinal|p_rghFinal|pcorrFinal)"
    {
        $p;
        relTol          0;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    UFinal
    {
        $U;
        relTol           0;
    }

%}
%{%(solver/solverName%)
%:interFoam multiphaseInterFoam
    "alpha.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

%}
%{%(physics/Turbulence%)
%:RANS
    "(k|omega|nuTilda)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
        minIter          1;
    }

    "(k|omega|nuTilda)Final"
    {
        $k;
        relTol          0;
    }

%}
%{%(solver/solverName%)
%:hisa
    yPsi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-3;
        relTol          0;
    }

    yWall
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-8;
        relTol          0;
    }

%}
    Phi
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
}

relaxationFactors
{
    // Conservative settings to solve reliably on bad
    // meshes
%{%(physics/Time%)
%:Steady
    equations
    {
        U               0.6;
%{%(physics/Turbulence%)
%:RANS
%{%(physics/TurbulenceModel%)
%:kOmegaSST
        k               0.5;
        omega           0.5;
%}
%}
    }
    fields
    {
        p               0.3;
    }
%:Transient
    equations
    {
%{%(solver/solverName%)
%:default
        U               0.6;
        UFinal          1;
%}
%{%(physics/Turbulence%)
%:RANS
%{%(physics/TurbulenceModel%)
%:kOmegaSST
        k               0.5;
        kFinal          1;
        omega           0.5;
        omegaFinal      1;
%:SpalartAllmaras
        nuTilda         0.5;
%}
%}
    }
%{%(solver/solverName%)
%:hisa
    yWall               0.7;
%}
%{%(solver/solverName%)
%:default
q    fields
    {
        p               0.3;
    }
%}
%}
}

cache
{
    grad(U);
}

// ************************************************************************* //
